In [27]:
print("AKKUL VERMA-102203579")
import pandas as pd
     

df=pd.DataFrame()
     

df['Name']=['a','b','c','d','e','f','g','h','i','j']
df['Age']=[10,9,8,7,6,5,4,3,2,15]
df['Roll no']=['120','121','122','123','124','125','126','127','128','129']
df['Gender']=['M','F','M','F','M','F','M','F','M','F']
df

AKKUL VERMA-102203579

  Name  Age Roll no Gender
0    a   10     120      M
1    b    9     121      F
2    c    8     122      M
3    d    7     123      F
4    e    6     124      M
5    f    5     125      F
6    g    4     126      M
7    h    3     127      F
8    i    2     128      M
9    j   15     129      F

In [2]:
df.iloc[4], df.iloc[1:4], df.iloc[:], df.iloc[1:4, 5:8]

(Name         e
 Age          6
 Roll no    124
 Gender       M
 Name: 4, dtype: object,
   Name  Age Roll no Gender
 1    b    9     121      F
 2    c    8     122      M
 3    d    7     123      F,
   Name  Age Roll no Gender
 0    a   10     120      M
 1    b    9     121      F
 2    c    8     122      M
 3    d    7     123      F
 4    e    6     124      M
 5    f    5     125      F
 6    g    4     126      M
 7    h    3     127      F
 8    i    2     128      M
 9    j   15     129      F,
 Empty DataFrame
 Columns: []
 Index: [1, 2, 3])

In [3]:
df[df['Gender']=='M']

  Name  Age Roll no Gender
0    a   10     120      M
2    c    8     122      M
4    e    6     124      M
6    g    4     126      M
8    i    2     128      M

In [4]:
df.replace("F","Woman")

  Name  Age Roll no Gender
0    a   10     120      M
1    b    9     121  Woman
2    c    8     122      M
3    d    7     123  Woman
4    e    6     124      M
5    f    5     125  Woman
6    g    4     126      M
7    h    3     127  Woman
8    i    2     128      M
9    j   15     129  Woman

In [5]:
df['Gender'].replace(["Woman","male"],["M","man"])

0    M
1    F
2    M
3    F
4    M
5    F
6    M
7    F
8    M
9    F
Name: Gender, dtype: object

In [6]:
df

  Name  Age Roll no Gender
0    a   10     120      M
1    b    9     121      F
2    c    8     122      M
3    d    7     123      F
4    e    6     124      M
5    f    5     125      F
6    g    4     126      M
7    h    3     127      F
8    i    2     128      M
9    j   15     129      F

In [11]:

df.rename(columns={'Gender':'Sex'})

  Name  Age Roll no Sex
0    a   10     120   M
1    b    9     121   F
2    c    8     122   M
3    d    7     123   F
4    e    6     124   M
5    f    5     125   F
6    g    4     126   M
7    h    3     127   F
8    i    2     128   M
9    j   15     129   F

In [12]:
df.rename(columns={'Sex':'Gender'})

  Name  Age Roll no Gender
0    a   10     120      M
1    b    9     121      F
2    c    8     122      M
3    d    7     123      F
4    e    6     124      M
5    f    5     125      F
6    g    4     126      M
7    h    3     127      F
8    i    2     128      M
9    j   15     129      F

In [13]:
a=df['Age'].max()
print(a)

15

In [14]:

b=df['Age'].min()
print(b)

2

In [15]:

print(df['Age'].sum())

69

In [16]:

print(df['Age'].mean())

6.9

In [17]:
print(df['Age'].count())

10

In [18]:
print(df['Gender'].unique())

['M' 'F']

In [19]:

print(df['Gender'].nunique())

2

In [20]:
print(df['Gender'].value_counts())

Gender
M    5
F    5
Name: count, dtype: int64

In [21]:

df.drop(['Age'],axis=1)

  Name Roll no Gender
0    a     120      M
1    b     121      F
2    c     122      M
3    d     123      F
4    e     124      M
5    f     125      F
6    g     126      M
7    h     127      F
8    i     128      M
9    j     129      F

In [22]:
df[df['Gender']!='M']

  Name  Age Roll no Gender
1    b    9     121      F
3    d    7     123      F
5    f    5     125      F
7    h    3     127      F
9    j   15     129      F

In [23]:
print(df.groupby('Age').sum())

    Name Roll no Gender
Age
2      i     128      M
3      h     127      F
4      g     126      M
5      f     125      F
6      e     124      M
7      d     123      F
8      c     122      M
9      b     121      F
10     a     120      M
15     j     129      F

In [24]:
for name in df['Name']:
  print(name.upper())

A
B
C
D
E
F
G
H
I
J

In [25]:

import numpy as np
df['Age'].apply(np.sqrt)

0    3.162278
1    3.000000
2    2.828427
3    2.645751
4    2.449490
5    2.236068
6    2.000000
7    1.732051
8    1.414214
9    3.872983
Name: Age, dtype: float64

In [26]:
df.groupby('Gender').apply(lambda x: x.count())

        Name  Age  Roll no  Gender
Gender
F          5    5        5       5
M          5    5        5       5